Revit 2027 API
TransactionAttribute Class
 The custom transaction attribute to control the transaction behavior of the external command.
Inheritance Hierarchy
System.Object
 System.Attribute
 Autodesk.Revit.Attributes.TransactionAttribute
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TransactionAttribute : Attribute
Public Class TransactionAttribute
	Inherits Attribute
public ref class TransactionAttribute : public Attribute
type TransactionAttribute =
    class
        inherit Attribute
    end
The TransactionAttribute type exposes the following members.
Constructors
Name | Description
TransactionAttribute | Constructs a new TransactionAttribute.
Top
Properties
Name | Description
Mode | Transaction mode.
TypeId | When implemented in a derived class, gets a unique identifier for this Attribute.
(Inherited from Attribute)
Top
Methods
Name | Description
Equals | Returns a value that indicates whether this instance is equal to a specified object.
(Inherited from Attribute)
GetHashCode | Returns the hash code for this instance.
(Inherited from Attribute)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsDefaultAttribute | When overridden in a derived class, indicates whether the value of this instance is the default value for the derived class.
(Inherited from Attribute)
Match | When overridden in a derived class, returns a value that indicates whether this instance equals a specified object.
(Inherited from Attribute)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.Attributes Namespace